mateuszsikora/slate/firmware/sdkconfig.defaults
# Slate firmware — build configuration.
#
# The board half is taken from the configuration S-3 verified by booting it and
# S-2 measured against (docs/spikes/s3.md appendix, docs/spikes/s2.md), so the
# firmware runs the same silicon settings the spikes reported numbers for.
#
# Every other option belongs to the issue that turns it on, because each comes
# with a measurement that should be taken in the same change that enables it:
# rollback arrived with #12 and core dump with #14, and display and LVGL are
# still #6's to add.

CONFIG_IDF_TARGET="esp32s3"

# --- Flash and PSRAM ---
# ESP32-S3-WROOM-1-N16R8, as read out of the silicon in #3 rather than as the
# vendor documentation describes it (§6.3).
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# SPIRAM_FETCH_INSTRUCTIONS and SPIRAM_RODATA stay off. S-3 enabled them to
# measure flash and S-2 disabled them to measure frame time, noting that they
# put code and constants on the same bus the framebuffer is scanned out over.
# That is a display decision on display evidence, so it is #6's to make.

# --- Partition table ---
# Settled in #5 against S-3, documented in §6.3. NVS and LittleFS sit outside
# the two application slots, which is the whole reason this issue can promise
# that an OTA does not take the configuration and the tokens with it.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Development OTA rollback (design.md §11.2) ---
# A freshly uploaded image gets one boot in PENDING_VERIFY. slate_ota confirms
# it only after GET /api/v1/info answers on a real station or setup-AP address;
# any reset before then makes the bootloader return to the previous slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- Core dump (design.md §11.3) ---
# A panic writes an ELF core dump into the `coredump` partition #5 reserved, and
# GET /api/v1/coredump serves it. The ELF format rather than the binary one
# because it is what esp-coredump symbolicates a backtrace from; the binary
# format is a task-and-stack blob with no notes in it.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# ESP-IDF's own boot-time integrity check is turned off because slate_coredump
# does it: CHECK_BOOT reads and checksums the whole dump in 32-byte flash
# transactions — some 800 of them for the 26 KB dump #14 measured, each with the
# cache and interrupts off on both cores — and then logs a line that says less
# than the boot report does. Once per boot rather than twice, and the one that
# survives names the crashed task and whether this firmware can symbolicate it.
CONFIG_ESP_COREDUMP_CHECK_BOOT=n

# Two knobs are deliberately left at their ESP-IDF defaults, because both
# defaults are the right answer here and the reason is not obvious from the name:
#
#   ESP_COREDUMP_CAPTURE_DRAM (n) adds the whole of .bss, .data and the heap to
#   the dump. Espressif asks for at least 128 KB of coredump partition for that
#   — which is the entire partition (§6.3), sized against a dump of task stacks.
#   A dump that does not fit is §6.3's "worse than no partition at all".
#
#   ESP_COREDUMP_CHECKSUM_CRC32 (the default) over SHA256: the checksum protects
#   a development artifact travelling over a LAN, and SHA256 needs more of the
#   dump stack below to compute — stack that is spent inside a panic handler.
#
# What core dump costs in internal memory, measured rather than added up. The
# boot report's free-DIRAM line moved from 232 575 B to 228 307 B when these
# options went in: 4 268 B, on a panel with the station up.
#
# The largest identified piece is a dump stack of its own, and it is worth
# naming because nothing asked for it: with SPIRAM=y,
# FREERTOS_TASK_CREATE_ALLOW_EXT_MEM defaults to y, which makes
# ESP_COREDUMP_USE_STACK_SIZE=y and reserves ESP_COREDUMP_STACK_SIZE (1792 B).
# That part is not optional — a task whose stack is in PSRAM cannot be dumped
# from that stack. The remaining ~2.5 KB is the component's own DRAM: its log
# strings, which ESP_COREDUMP_LOGS=y keeps (ESP-IDF's help says disabling them
# saves "~5KB", which is evidently an upper bound), plus its static state. Kept:
# the panic path is the one place where a log line cannot be recovered later.
#
# §6.2's budget carries all 4 268 B. Its S-2 figure is for a display-bearing
# image and is not this number, which is why the live value is printed on every
# boot instead of assumed.

# --- Tasks ---
# app_main brings the store up and will bring the display, WiFi and the HTTP
# server up as those land. The default 3584 B is not enough headroom for that.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- HTTP/WebSocket diagnostics (design.md §4.2, §11.3) ---
# The upgrade itself is public and the first application frame authenticates.
# POST_HANDSHAKE is what starts the five-second deadline before any frame has
# arrived; registering a client only from the data handler cannot time out a
# peer that upgrades and then remains silent.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y

# --- Home Assistant WebSocket client (design.md §5.5, issue #16) ---
# The manual fallback may point at an HTTPS Home Assistant URL. Verify public
# certificates against the same compact common-roots bundle S-3 measured;
# disabling verification would send the long-lived token to an unauthenticated
# peer and contradict §12's treatment of it as a credential.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

# --- Display and LVGL (design.md §6.1–§6.2, issue #6) ---
# S-2 measured frame time with these cache settings. The RGB peripheral reads
# two 800×480 RGB565 framebuffers continuously from PSRAM; the 64-byte line and
# 64 KiB data cache are the geometry Espressif recommends for that path.
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# The LVGL task waits at most 10 ms between timer passes and synchronises a
# framebuffer switch to a 26.4 ms panel scan. A 100 Hz RTOS tick turns both into
# 10 ms steps; S-2 used 1 kHz to keep the scheduler out of the display timing.
CONFIG_FREERTOS_HZ=1000

# The widget allocator is a fixed 2 MiB pool in PSRAM. firmware/CMakeLists.txt
# supplies LV_MEM_POOL_ALLOC because LVGL has no Kconfig setting for where that
# pool is allocated. Keeping the built-in allocator also preserves
# lv_mem_monitor(), which §4.1 exposes later.
CONFIG_LV_USE_BUILTIN_MALLOC=y
CONFIG_LV_MEM_SIZE_KILOBYTES=2048
CONFIG_LV_USE_ASSERT_MALLOC=y
CONFIG_LV_COLOR_DEPTH_16=y

# 33 ms is 30.3 Hz and beats visibly against this panel's measured 37.82 Hz.
# At 10 ms LVGL is ready before each scan; the flush gate makes VSYNC, rather
# than this timer, decide when the next rendered frame may begin.
CONFIG_LV_DEF_REFR_PERIOD=10

# Keep one built-in face as LVGL's allocator-safe fallback. Slate-owned widgets
# select #21's generated bpp:4 faces explicitly through slate_theme; this face
# remains for LVGL internals and any emergency presentation built before those
# widgets exist.
CONFIG_LV_FONT_MONTSERRAT_14=y

# The setup and editor-address codes are rendered by LVGL on the panel, so they use the
# library's canvas-backed QR widget instead of introducing a second image
# renderer or storing a generated bitmap in flash.
CONFIG_LV_USE_QRCODE=y

# The firmware consumes LVGL as a runtime, not as an example gallery. These do
# not survive the linker when unused, but disabling them keeps clean builds from
# compiling hundreds of irrelevant translation units.
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# --- Clock (§6.1) ---
# The router's own NTP server arrives with the DHCP lease and is preferred over
# the compiled-in pool, which is what makes the clock work on a LAN with no
# route to the internet — the topology of §2 needs nothing else from outside.
# Two server slots because the DHCP one takes slot 0 and the fallback moves to
# slot 1; see slate_time.c, which spells the same arrangement in code.
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- mDNS interfaces (design.md §4.3) ---
# `slate-<mac>.local` has to answer on the station and on the setup access
# point, because §4.3 promises the same name works before the panel has ever
# joined a network. Both are the mdns component's own defaults; they are pinned
# here for the reason the LittleFS geometry below is pinned — a default that
# moves in a component upgrade is a name that quietly stops answering on one
# interface, and nothing in a build log says so.
CONFIG_MDNS_PREDEF_NETIF_STA=y
CONFIG_MDNS_PREDEF_NETIF_AP=y

# --- LittleFS geometry ---
# Pinned rather than left at the component's defaults, because these values
# are the on-disk format. littlefs stores the name length in the superblock and
# validates it at mount, and the read/write/page sizes decide the layout — so a
# component upgrade that shifts a default turns a mount into a reformat, which
# with format_if_mount_failed is a configuration erased on the first boot after
# an OTA. Written here so the values live in the repository rather than only in
# the gitignored sdkconfig.
CONFIG_LITTLEFS_PAGE_SIZE=256
CONFIG_LITTLEFS_OBJ_NAME_LEN=64
CONFIG_LITTLEFS_READ_SIZE=128
CONFIG_LITTLEFS_WRITE_SIZE=128
CONFIG_LITTLEFS_LOOKAHEAD_SIZE=128
CONFIG_LITTLEFS_CACHE_SIZE=512
CONFIG_LITTLEFS_BLOCK_CYCLES=512
